{
   "class_name": "Functional",
   "config": {
      "name": "ANN",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  95,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
         },
         {
            "class_name": "Flatten",
            "config": {
               "name": "flatten",
               "trainable": true,
               "dtype": "float32",
               "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [
               [
                  [
                     "input_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense",
               "trainable": true,
               "dtype": "float32",
               "units": 48,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
               [
                  [
                     "flatten",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation",
               "trainable": true,
               "dtype": "float32",
               "activation": "sigmoid"
            },
            "name": "activation",
            "inbound_nodes": [
               [
                  [
                     "dense",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
               [
                  [
                     "activation",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_1",
               "trainable": true,
               "dtype": "float32",
               "units": 48,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
               [
                  [
                     "dropout",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_1",
               "trainable": true,
               "dtype": "float32",
               "activation": "sigmoid"
            },
            "name": "activation_1",
            "inbound_nodes": [
               [
                  [
                     "dense_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_1",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
               [
                  [
                     "activation_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_1",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_1",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_2",
               "trainable": true,
               "dtype": "float32",
               "units": 24,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
               [
                  [
                     "dropout_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_2",
               "trainable": true,
               "dtype": "float32",
               "activation": "sigmoid"
            },
            "name": "activation_2",
            "inbound_nodes": [
               [
                  [
                     "dense_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_2",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
               [
                  [
                     "activation_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_2",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_2",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_3",
               "trainable": true,
               "dtype": "float32",
               "units": 12,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [
               [
                  [
                     "dropout_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_3",
               "trainable": true,
               "dtype": "float32",
               "activation": "sigmoid"
            },
            "name": "activation_3",
            "inbound_nodes": [
               [
                  [
                     "dense_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_3",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
               [
                  [
                     "activation_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_3",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_3",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_4",
               "trainable": true,
               "dtype": "float32",
               "units": 2,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L2",
                  "config": {
                     "l2": 0.0020000000949949026
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [
               [
                  [
                     "dropout_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_4",
               "trainable": true,
               "dtype": "float32",
               "activation": "softmax"
            },
            "name": "activation_4",
            "inbound_nodes": [
               [
                  [
                     "dense_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "input_1",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "activation_4",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.10.0",
   "backend": "tensorflow"
}